cmsis-svd/cmsis-svd/data/GigaDevice/GD32E50x_HD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MASTER_TIMER</name>
      <description>SHRTIMER  Master TIMER</description>
      <groupName>SHRTIMER</groupName>
      <baseAddress>0x40017400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SHRTIMER_IRQ0</name>       
        <value>76</value>
      </interrupt>
      <registers>
        <register>
          <name>MTCTL0</name>
          <displayName>MTCTL0</displayName>
          <description>SHRTIMER Master_TIMER control register 0</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
           <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPSEL</name>
              <description>Update event selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>UPREP</name>
              <description>Update event generated by repetition event</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>     
            <field>
              <name>SHWEN</name>
              <description>Shadow registers enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACTRGS</name>
              <description>Trigger source to DAC</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>   
            <field>
              <name>ST4CEN</name>
              <description>The counter of Slave_TIMER4 enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>ST3CEN</name>
              <description>The counter of Slave_TIMER3 enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>     
            <field>
              <name>ST2CEN</name>
              <description>The counter of Slave_TIMER2 enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
            <field>
              <name>ST1CEN</name>
              <description>The counter of Slave_TIMER1 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>ST0CEN</name>
              <description>The counter of Slave_TIMER0 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>   
            </field>
            <field>
              <name>MTCEN</name>
              <description>The counter of Master_TIMER enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>SYNOSRC</name>
              <description>Synchronization output source</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>   
            </field> 
            <field>
              <name>SYNOPLS</name>
              <description>Synchronization output pulse</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>   
            </field> 
            <field>
              <name>SYNISTRT</name>
              <description>Synchronization input start counter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>SYNIRST</name>
              <description>Synchronization input reset counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>SYNISRC</name>
              <description>Synchronization input source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>   
            </field>
            <field>
              <name>HALFM</name>
              <description>Half mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>CNTRSTM</name>
              <description>Counter reset mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>   
            </field>   
            <field>
              <name>CTNM</name>
              <description>Continuous mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>   
            </field> 
            <field>
              <name>CNTCKDIV</name>
              <description>Counter clock division</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>   
            </field>                 
          </fields>
        </register>
        <register>
          <name>MTINTF</name>
          <displayName>MTINTF</displayName>
          <description>SHRTIMER Master_TIMER interrupt flag register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPIF</name>
              <description>Update interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNIIF</name>
              <description>Synchronization input interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>REPIF</name>
              <description>Repetition interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IF</name>
              <description>Compare 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IF</name>
              <description>Compare 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IF</name>
              <description>Compare 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IF</name>
              <description>Compare 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTINTC</name>
          <displayName>MTINTC</displayName>
          <description>SHRTIMER Master_TIMER interrupt flag clear register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPIFC</name>
              <description>Clear update interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNIIFC</name>
              <description>Clear synchronization input interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>REPIFC</name>
              <description>Clear repetition interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IFC</name>
              <description>Clear compare 3 interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IFC</name>
              <description>Clear compare 2 interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IFC</name>
              <description>Clear compare 1 interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IFC</name>
              <description>Clear compare 0 interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTDMAINTEN</name>
          <displayName>MTDMAINTEN</displayName>
          <description>SHRTIMER Master_TIMER DMA and interrupt enable register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDEN</name>
              <description>Update DMA request enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNIDEN</name>
              <description>Synchronization input DMA request enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>REPDEN</name>
              <description>Repetition DMA request enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3DEN</name>
              <description>Compare 3 DMA request enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2DEN</name>
              <description>Compare 2 DMA request enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1DEN</name>
              <description>Compare 1 DMA request enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0DEN</name>
              <description>Compare 0 DMA request enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPIE</name>
              <description>Update interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNIIE</name>
              <description>Synchronization input interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
           </field>      
           <field>
              <name>REPIE</name>
              <description>Repetition interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>      
            <field>
              <name>CMP3IE</name>
              <description>Compare 3 interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2IE</name>
              <description>Compare 2 interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP1IE</name>
              <description>Compare 1 interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP0IE</name>
              <description>Compare 0 interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCNT</name>
          <displayName>MTCNT</displayName>
          <description>SHRTIMER Master_TIMER counter register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>The current counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCAR</name>
          <displayName>MTCAR</displayName>
          <description>SHRTIMER Master_TIMER counter auto reload register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CARL</name>
              <description>Counter auto reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCREP</name>
          <displayName>MTCREP</displayName>
          <description>SHRTIMER Master_TIMER counter repetition register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CREP</name>
              <description>Counter repetition value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCMP0V</name>
          <displayName>MTCMP0V</displayName>
          <description>SHRTIMER Master_TIMER compare 0 value register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP0VAL</name>
              <description>Compare 0 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCMP1V</name>
          <displayName>MTCMP1V</displayName>
          <description>SHRTIMER Master_TIMER compare 1 value register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP1VAL</name>
              <description>Compare 1 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCMP2V</name>
          <displayName>MTCMP2V</displayName>
          <description>SHRTIMER Master_TIMER compare 2 value register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP2VAL</name>
              <description>Compare 2 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTCMP3V</name>
          <displayName>MTCMP3V</displayName>
          <description>SHRTIMER Master_TIMER compare 3 value register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP3VAL</name>
              <description>Compare 3 value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MTACTL</name>
          <displayName>MTACTL</displayName>
          <description>SHRTIMER Master_TIMER additional control register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTCKDIV_3</name>
              <description>Counter clock division</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
